In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 날짜 간 개월 수 출력하기(Months_between)

<br>

날짜 - 숫자 = 날짜  
날짜 + 숫자 = 날짜  
날짜 - 날짜 = 숫자  

- 날짜 함수
	1. Months_between
	2. Add_months
	3. Next_day
	4. Last_day

<br>

※ 오늘 날짜 확인하는 방법

In [7]:
%%sql

select sysdate
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2021, 7, 16, 15, 31, 34),)]

In [8]:
%%sql

select sysdate-1
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2021, 7, 15, 15, 31, 37),)]

문제 80. 아래의 결과에서 소수점 이하를 안나오게 반올림하시오  
Select sysdate - hiredate  
   from emp;

In [13]:
%%sql

select round(sysdate - hiredate)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(14487,),
 (14687,),
 (14679,),
 (14717,),
 (14555,),
 (14766,),
 (14575,),
 (14463,),
 (14754,),
 (14463,),
 (14830,),
 (14087,),
 (14063,),
 (14432,)]

문제 81. 이름, 입사한 날짜부터 오늘까지 총 몇주 근무했는지 출력하시오

In [19]:
%%sql

select ename, round((sysdate - hiredate)/7)||' 주' "총 근무주"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', '2070 주'),
 ('BLAKE', '2098 주'),
 ('CLARK', '2097 주'),
 ('JONES', '2102 주'),
 ('MARTIN', '2079 주'),
 ('ALLEN', '2109 주'),
 ('TURNER', '2082 주'),
 ('JAMES', '2066 주'),
 ('WARD', '2108 주'),
 ('FORD', '2066 주'),
 ('SMITH', '2119 주'),
 ('SCOTT', '2012 주'),
 ('ADAMS', '2009 주'),
 ('MILLER', '2062 주')]

문제 82. 이름, 입사한 날짜부터 오늘까지 총 몇 달 근무했는지 출력하시오

In [28]:
%%sql

select ename, round(months_between(sysdate, hiredate))||' 달' "총 근무달"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', '476 달'),
 ('BLAKE', '483 달'),
 ('CLARK', '482 달'),
 ('JONES', '484 달'),
 ('MARTIN', '478 달'),
 ('ALLEN', '485 달'),
 ('TURNER', '479 달'),
 ('JAMES', '475 달'),
 ('WARD', '485 달'),
 ('FORD', '475 달'),
 ('SMITH', '487 달'),
 ('SCOTT', '463 달'),
 ('ADAMS', '462 달'),
 ('MILLER', '474 달')]

- months_between(최신날짜, 옛날날짜)
    - 날짜와 날짜 사이의 개월 수를 출력가능
    - 오늘까지의 날짜 수를 알고 싶다면 sysdate를 쓰면 된다.
    
<br>
    
문제 83. 아래와 같이 결과를 출력하시오  
         ---KING은 467달을 근무했습니다---

In [33]:
%%sql

select ename||'은 '||
       round(months_between(sysdate, hiredate))||'달을 근무했습니다' as "근무 개월"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING은 476달을 근무했습니다',),
 ('BLAKE은 483달을 근무했습니다',),
 ('CLARK은 482달을 근무했습니다',),
 ('JONES은 484달을 근무했습니다',),
 ('MARTIN은 478달을 근무했습니다',),
 ('ALLEN은 485달을 근무했습니다',),
 ('TURNER은 479달을 근무했습니다',),
 ('JAMES은 475달을 근무했습니다',),
 ('WARD은 485달을 근무했습니다',),
 ('FORD은 475달을 근무했습니다',),
 ('SMITH은 487달을 근무했습니다',),
 ('SCOTT은 463달을 근무했습니다',),
 ('ADAMS은 462달을 근무했습니다',),
 ('MILLER은 474달을 근무했습니다',)]

# 개월 수 더한 날짜 출력하기 (ADD_MONTHS)

오늘 날짜에서 100달 뒤에 돌아오는 날짜가 몇일인가?

In [35]:
%%sql

select add_months(sysdate, 100)
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2029, 11, 16, 15, 44, 6),)]

# 특정 날짜 뒤에 오는 요일 날짜 출력하기(NEXT_DAY)

오늘부터 앞으로 바로 돌아올 월요일의 날짜를 출력하시오!

In [37]:
%%sql

select next_day(sysdate, '월요일')
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2021, 7, 19, 15, 44, 48),)]

오늘 날짜에서 100 달 뒤에 돌아오는 목요일의 날짜를 출력하시오!

In [41]:
%%sql

select Next_Day(Add_Months(Sysdate, 100),'목요일') "오늘 날짜에서 100 달 뒤에 돌아오는 목요일의 날짜"
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2029, 11, 22, 15, 46, 53),)]

# 특정 날짜가 있는 달의 마지막 날짜 출력하기(LAST_DAY)

In [43]:
%%sql

Select sysdate, last_day(sysdate)
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(datetime.datetime(2021, 7, 16, 15, 47, 46), datetime.datetime(2021, 7, 31, 15, 47, 46))]

In [49]:
%%sql

Select *
  from nls_session_parameters

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('NLS_LANGUAGE', 'KOREAN'),
 ('NLS_TERRITORY', 'KOREA'),
 ('NLS_CURRENCY', '￦'),
 ('NLS_ISO_CURRENCY', 'KOREA'),
 ('NLS_NUMERIC_CHARACTERS', '.,'),
 ('NLS_CALENDAR', 'GREGORIAN'),
 ('NLS_DATE_FORMAT', 'RR/MM/DD'),
 ('NLS_DATE_LANGUAGE', 'KOREAN'),
 ('NLS_SORT', 'BINARY'),
 ('NLS_TIME_FORMAT', 'HH24:MI:SSXFF'),
 ('NLS_TIMESTAMP_FORMAT', 'RR/MM/DD HH24:MI:SSXFF'),
 ('NLS_TIME_TZ_FORMAT', 'HH24:MI:SSXFF TZR'),
 ('NLS_TIMESTAMP_TZ_FORMAT', 'RR/MM/DD HH24:MI:SSXFF TZR'),
 ('NLS_DUAL_CURRENCY', '￦'),
 ('NLS_COMP', 'BINARY'),
 ('NLS_LENGTH_SEMANTICS', 'BYTE'),
 ('NLS_NCHAR_CONV_EXCP', 'FALSE')]

# 날짜 함수를 사용할 시 유의사항
<br>
날짜 함수를 쓸 때 현재 내가 접속한 세션의 날짜 형식을 확인해야 함   

<br>

Selet *    
 
  from nls_session_parameters;

<br>
<br>
Alter session set nls_date, format='DD/MM/RR' -> 환경 날짜 변경 코드
<br>

- 날짜 형식
    - 년도: RRRR, YYYY, RR, YY
    - 월: MM, MON(NOV, DEC)
    - 일: DD
    - 요일: DAY, DY, D
    - 시간: HH, HH24
    - 분: MI
    - 초: SS

<br>

![image](https://user-images.githubusercontent.com/70187490/125906081-46fd5f92-ad2d-4b06-bbe3-945d5e07e278.png)

Alter session set nls_date, format='YY/MM/RR'  
Select hiredate from emp;

# 문자형으로 데이터 유형 변환하기(To_char)

숫자형 ---> 문자형으로 변환  
날짜형 ---> 문자형으로 변환할 때 사용하는 함수  

![image](https://user-images.githubusercontent.com/70187490/125906774-305ac3c8-c589-4285-9554-5d2ac5857bd2.png)


<br>

   오늘이 무슨 요일인지 출력하고 싶다면?

In [50]:
%%sql

select to_char(sysdate, 'day')
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('금요일',)]

문제 86. 이름, 입사일, 입사한 요일을 출력하시오!

In [55]:
%%sql

select ename, To_char(hiredate, 'DAY')"입사일"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', '화요일'),
 ('BLAKE', '금요일'),
 ('CLARK', '토요일'),
 ('JONES', '수요일'),
 ('MARTIN', '목요일'),
 ('ALLEN', '수요일'),
 ('TURNER', '금요일'),
 ('JAMES', '금요일'),
 ('WARD', '월요일'),
 ('FORD', '금요일'),
 ('SMITH', '화요일'),
 ('SCOTT', '수요일'),
 ('ADAMS', '토요일'),
 ('MILLER', '월요일')]

문제 87. 수요일에 입사한 사원들의 이름과 입사일을 출력하시오!

In [57]:
%%sql

select ename, hiredate
    from emp
    where To_char(hiredate,'day') = '수요일'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('ALLEN', datetime.datetime(1981, 2, 11, 0, 0)),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0))]

문제 88. 내가 무슨 요일에 태어났는지 확인하시오!

In [61]:
%%sql

select To_char(To_date('89/01/20', 'RR/MM/DD'), 'day')"생일"
    from dual

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('금요일',)]

문제 89. 이름, 입사한 요일을 출력하는데 입사한 요일이 월화수목금토일 순으로 출력되게 하시오

In [78]:
%%sql

select ename, hiredate, To_char(To_date(hiredate, 'RRRR/MM/DD'),'day')
    from emp
    order by To_char(To_date(hiredate, 'RRRR/MM/DD')-1,'d')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('WARD', datetime.datetime(1981, 2, 23, 0, 0), '월요일'),
 ('MILLER', datetime.datetime(1982, 1, 11, 0, 0), '월요일'),
 ('KING', datetime.datetime(1981, 11, 17, 0, 0), '화요일'),
 ('SMITH', datetime.datetime(1980, 12, 9, 0, 0), '화요일'),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0), '수요일'),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0), '수요일'),
 ('ALLEN', datetime.datetime(1981, 2, 11, 0, 0), '수요일'),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0), '목요일'),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0), '금요일'),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0), '금요일'),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0), '금요일'),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0), '금요일'),
 ('ADAMS', datetime.datetime(1983, 1, 15, 0, 0), '토요일'),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0), '토요일'),
 ('JACK', datetime.datetime(1982, 1, 10, 0, 0), '일요일')]